---
type: RevisionCloud
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# RevisionCloud

`Autodesk.Revit.DB.RevisionCloud` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2015 | `public static RevisionCloud Create ( Document document , View view , ElementId revisionId , IList < Curve > curves )` |
| Method | GetSheetIds | 2015 | `public ISet < ElementId > GetSheetIds ()` |
| Method | GetSketchCurves | 2015 | `public IList < Curve > GetSketchCurves ()` |
| Method | IsRevisionIssued | 2015 | `public bool IsRevisionIssued ()` |
| Property | Parameter | — | `` |
| Property | RevisionId | 2015 | `public ElementId RevisionId { get ; set ; }` |